# Хужшее O(n2), лучшее O(n)

from random import randint

#   Создадим список

lst = []
for i in range(10):
    lst.append(randint(1, 100))

for run in range(len(lst) - 1):  # Цикл выполняется столько раз, сколько элементов в списке, длина - 1 потому что
    # последний элемент не имеет соседа справа и сравнивать ничего уже не нужно

    for j in range(len(lst) - run - 1):  # Во вложенном цикле сравниваются сами пары элементов, они сравниваются столько
        # раз, сколько у нас всего элементов. - run нужен для того, чтобы не сравнивать элементы в конце, которые
        # уже нашли своё место, является оптимизацией. - 1 чтобы не делать последний обход т.к. на этом этапе
        # все числа уже стоят на своих местах

        if lst[j] > lst[j + 1]:
            lst[j], lst[j + 1] = lst[j + 1], lst[j]
