conversion = {1000: 'M', 900: 'CM', 500: 'D', 400: 'CD', 100: 'C',
              90: 'XC', 50: 'L', 40: 'XL', 10: 'X', 9: 'IX', 5: 'V', 4: 'IV', 1: 'I'}
n = int(input())
while n:
    for i in conversion:
        if (n - i) >= 0 and n >= i:  # Проверяем. Если исходное число не будет меньше 0
            # и если число из словаря равно или меньше
            while n >= i:  # пока оно меньше или равно цикл приостанаавливается и отнимается это число
                n = n - i  # отнимам это число
                print(conversion[i], end='')
