# Задача. Дано список чисел, выбирается 1 день для покупки и 1 день для продажи.
# В какие 2 дня можно получить максимальную выгоду, путём продажи большего велью из меньшего в списке

def maxProfit(prices) -> int:
    max_profit = 0

    min_price = prices[0]  # Задаём минимум цену как первый элемент списка

    # Начинаем со 2 элемента списка т.к. первый уже занят минимальной ценой
    for i in range(1, len(prices)):
        min_price = min(min_price, prices[
            i])  # Обновляем минимальную цену сравнив 2 соседних элемента, с уже имеющимся значением минимума
        max_profit = max(max_profit, prices[
            i] - min_price)  # Обновляем максимальную выгоду, сравнивая уже имеющуюся с результатом вычитания
    return max_profit


print(maxProfit([7, 1, 5, 3, 6, 4]))
